[
  {
    "date": "2025-10-12",
    "version": "v1.8.0",
    "title": "Mobile Optimization & Dashboard Enhancements",
    "description": "Improved mobile responsiveness for footer layout and added threat intelligence quick access to dashboard.",
    "changes": [
      "Fixed mobile footer layout issue where 'Discussions' link wrapped to next line",
      "Reduced icon sizes and gaps on mobile devices (sm:breakpoint responsive)",
      "Added whitespace-nowrap to footer link text for better mobile display",
      "Added Threat Intel quick access button to Dashboard",
      "Updated dashboard tools grid to include threat intelligence monitoring",
      "Improved footer accessibility with responsive sizing"
    ]
  },
  {
    "date": "2025-10-12",
    "version": "v1.7.0",
    "title": "External Crypto Tools Enhancement",
    "description": "Comprehensive external cryptography tools section with detailed descriptions and improved UX.",
    "changes": [
      "Added 5 external crypto tool links with descriptions: dCode.fr, CrypTii, CacheSleuth, Boxentriq, CyberChef",
      "Moved external tools section above 'Recent Operations' for better visibility",
      "Implemented 2-column responsive grid layout for tool cards",
      "Added hover effects with accent border and background transitions",
      "Included detailed descriptions explaining each tool's specialty",
      "Globe icons for consistent visual identity across all external links"
    ]
  },
  {
    "date": "2025-10-12",
    "version": "v1.6.0",
    "title": "Crypto Tools External References",
    "description": "Initial integration of external cryptography tool redirects for expanded capabilities.",
    "changes": [
      "Added visible redirect section for external crypto tools",
      "Integrated CrypTii (Caesar cipher) quick access link",
      "Added CyberChef link for advanced data transformation",
      "Created 'Need More Crypto Tools?' section with clear call-to-action",
      "Opens external tools in new tabs with security attributes (noopener noreferrer)"
    ]
  },
  {
    "date": "2025-10-12",
    "version": "v1.5.0",
    "title": "Repository Synchronization & Documentation",
    "description": "Synchronized with latest upstream changes and improved project documentation.",
    "changes": [
      "Fetched and merged latest changes from sectoolbox/sectoolbox main branch",
      "Added MIT LICENSE to project root",
      "Updated package.json with proper metadata and license information",
      "Synchronized with v1.0.0 release tag",
      "Updated repository documentation for clarity",
      "Fixed file permissions and line endings (LF/CRLF handling)"
    ]
  },
  {
    "date": "2025-10-11",
    "version": "v1.4.0",
    "title": "Network Scanning & Payload Customization",
    "description": "Added HackerTarget Nmap integration with multiple scan types, comprehensive payload substitution system, and enhanced binary file analysis.",
    "changes": [
      "HackerTarget Nmap API integration with API key authentication",
      "Multiple scan type support: Nmap, DNS lookup, Reverse DNS, Host search, WHOIS, Zone transfer",
      "Target configuration system for Web Tools with domain, IP, and callback URL inputs",
      "Dynamic payload substitution with toggle control for XSS, SQL, RCE, SSRF, XXE, OAuth, LFI/RFI, CSRF payloads",
      "Comprehensive placeholder support with {DOMAIN}, {URL}, {IP}, {ATTACKER_IP}, {CALLBACK_URL} templates",
      "Enhanced Folder Scanner with multi-encoding string extraction (ASCII, UTF-8, UTF-16 LE/BE)",
      "Hex dump viewer for binary file inspection (first 1KB)",
      "Raw binary preview with advanced string detection",
      "Removed EVTX handling from Image Analysis page for cleaner separation of concerns",
      "Fixed syntax errors in ImageAnalysis tab conditionals"
    ]
  },
  {
    "date": "2025-10-10",
    "version": "v1.3.0",
    "title": "Threat Intelligence Integration",
    "description": "Comprehensive threat intelligence capabilities with 8 industry-standard APIs for malware analysis, breach detection, and security research.",
    "changes": [
      "VirusTotal API integration for malware scanning of files, URLs, domains, and IPs",
      "HaveIBeenPwned integration with k-anonymity for password and breach checking",
      "URLhaus malware database for URL reputation checking",
      "PhishStats phishing database for malicious site detection",
      "Cloudflare Trace for IP and visitor information lookup",
      "AbuseIPDB for IP reputation and abuse report checking",
      "GreyNoise community API for internet scanner identification",
      "AlienVault OTX threat intelligence platform integration",
      "Unified threat intelligence page with tabbed interface for all 8 APIs",
      "Serverless API proxies for CORS-free access to all services",
      "JSON export functionality for threat intelligence results",
      "Search integration with 8 new threat intel tools in database"
    ]
  },
  {
    "date": "2025-10-10",
    "version": "v1.2.0",
    "title": "Navigation Overhaul & UI Refinements",
    "description": "Complete navigation redesign with dropdown menus, comprehensive search, and multiple UI improvements.",
    "changes": [
      "Dropdown navigation with organized Analysis and Security Tools categories",
      "Global search functionality across all 60+ tools with keyword matching",
      "Mobile-responsive hamburger menu with organized sections",
      "Footer alignment fixes and padding adjustments",
      "Button label clarification across PCAP and Forensics pages",
      "Standardized button styling for consistency"
    ]
  },
  {
    "date": "2025-10-09",
    "version": "v1.1.0",
    "title": "Network Analysis & Memory Forensics",
    "description": "Added comprehensive network intelligence tools and advanced memory dump analysis capabilities.",
    "changes": [
      "Network analysis page with Shodan, IPInfo, PassiveDNS, crt.sh integration",
      "Archive.org CDX API with pagination, filtering, and injection point detection",
      "Memory Forensics module with process, DLL, network, and handle analysis",
      "Vercel serverless functions for CORS-free API access",
      "Quick upload cards for all major analysis types on Dashboard",
      "Folder Scanner auto-analyze functionality",
      "Web Tools favorites filter fix"
    ]
  },
  {
    "date": "2025-10-08",
    "version": "v1.0.0",
    "title": "Initial Release - Sectoolbox Launch",
    "description": "Professional cybersecurity toolkit for CTF competitions and security research now available.",
    "changes": [
      "Initial public release with complete toolkit suite",
      "Modern responsive UI design with dark mode",
      "Vercel deployment ready",
      "Complete documentation and usage guides"
    ]
  },
  {
    "date": "2025-10-08",
    "version": "v1.0.0-beta",
    "title": "Digital Forensics Suite",
    "description": "Comprehensive file analysis and digital evidence examination capabilities.",
    "changes": [
      "PCAP Analysis with network packet inspection and protocol analysis",
      "USB PCAP Analysis for USB traffic forensics",
      "EVTX Analysis for Windows Event Log parsing",
      "File signature and hex dump examination",
      "Entropy and statistical analysis",
      "Export functionality for all analysis types"
    ]
  },
  {
    "date": "2025-10-08",
    "version": "v1.0.0-beta",
    "title": "Image & Audio Analysis",
    "description": "Advanced media forensics tools for image and audio file investigation.",
    "changes": [
      "EXIF metadata extraction with GPS data",
      "Steganography detection and hidden data extraction",
      "Bit plane analysis and QR code scanning",
      "Spectral analysis for audio files",
      "DTMF detection and waveform visualization",
      "LSB analysis for hidden audio data"
    ]
  },
  {
    "date": "2025-10-08",
    "version": "v1.0.0-beta",
    "title": "Web Security & Cryptography",
    "description": "Extensive web exploitation payloads and cryptographic analysis tools.",
    "changes": [
      "240+ attack payloads across 26 categories",
      "SQL Injection, XSS, RCE, LFI/RFI, SSTI payloads",
      "Encoding/decoding tools (Base64, Hex, URL, Binary)",
      "Hash analysis and identification (MD5, SHA family)",
      "Classical ciphers (Caesar, Vigenere, ROT13, Atbash)",
      "Frequency analysis for cryptanalysis"
    ]
  },
  {
    "date": "2025-10-08",
    "version": "v1.0.0-alpha",
    "title": "Core Platform Development",
    "description": "Foundation development with modern React architecture and security focus.",
    "changes": [
      "React 19 + TypeScript 5.8 foundation",
      "Tailwind CSS + Shadcn/ui components",
      "Vite 7 build system optimization",
      "React Router 7 for navigation",
      "Responsive design implementation",
      "Dark mode interface"
    ]
  },
  {
    "date": "2025-10-07",
    "version": "v0.9.0-alpha",
    "title": "Project Initialization",
    "description": "Initial project setup and architecture planning for professional cybersecurity toolkit.",
    "changes": [
      "Project structure and planning",
      "Development environment setup",
      "Build and deployment configuration",
      "Documentation and contribution guidelines"
    ]
  }
]
