[
  {
    "date": "2025-10-16",
    "version": "v2.0.3",
    "title": "Python Forensics UI Polish & Source Map Fix",
    "description": "Improved Python Forensics interface with independent text size controls, centered toolbar, and cleaner layout.",
    "changes": [
      "Split text size controls: separate adjustments for Python Editor and Output Terminal",
      "Centered toolbar buttons for better visual balance",
      "Removed header text and description for cleaner, more focused interface",
      "Fixed Monaco Editor source map 404 warnings by disabling source maps in build",
      "Independent font sizing for editor and terminal (8px-32px range)",
      "Text size controls integrated directly into editor and terminal headers",
      "Improved UI consistency with border separators"
    ]
  },
  {
    "date": "2025-10-16",
    "version": "v2.0.2",
    "title": "Python Forensics UI Refactoring",
    "description": "Refactored Python Forensics interface by removing clutter and converting info boxes to accessible button-based popups.",
    "changes": [
      "Removed three card-based info boxes (Upload Files, Scripts, Quick Guide)",
      "Split file upload into separate 'Upload File' and 'Upload Folder' buttons",
      "Added file count badge to Upload File button showing number of uploaded files",
      "Created comprehensive Quick Guide popup with numbered steps and command reference",
      "Quick Guide popup includes 9 shell-like command cards with descriptions",
      "Cleaner toolbar with all functionality accessible via compact buttons",
      "More screen space dedicated to editor and terminal panels"
    ]
  },
  {
    "date": "2025-10-16",
    "version": "v2.0.1",
    "title": "Python Forensics Persistence & Performance",
    "description": "Implemented persistent Pyodide instance with localStorage state management for improved performance.",
    "changes": [
      "Global singleton Pyodide manager caches instance across page navigation",
      "Pyodide loads only once per browser session instead of on every /python visit",
      "Auto-save tabs, code, and output to localStorage every 3 seconds",
      "Auto-restore previous session state on page load or navigation return",
      "5-10 second initial load, then instant access on subsequent visits",
      "localStorage keys: sectoolbox_python_tabs, sectoolbox_python_output, sectoolbox_python_activeTab",
      "Safe concurrent access handling for Pyodide initialization"
    ]
  },
  {
    "date": "2025-10-16",
    "version": "v2.0.0",
    "title": "Python Forensics Major Update - Advanced Features",
    "description": "Complete overhaul of Python Forensics environment with file browser, visualization support, package management, and shell-like helper functions for CTF and forensics analysis.",
    "changes": [
      "Added File Browser/Explorer with tree view of uploaded files and folders",
      "Download any file from virtual filesystem with one click",
      "File preview with text display and hex dump for binary files",
      "Delete files directly from file browser interface",
      "Visualization Support: Display images directly in output using show_image() function",
      "Automatic image detection and rendering (PNG, JPEG, GIF, BMP)",
      "Package Manager UI with search functionality and one-click install",
      "Popular CTF/Forensics packages pre-listed (pycryptodome, pillow, numpy, pefile, requests, etc.)",
      "Uninstall capability for user-installed packages",
      "Real-time package installation status with loading indicators",
      "Shell-like helper functions: ls(), cat(), head(), tail(), grep(), hexdump(), tree(), pwd(), fileinfo()",
      "Unix-like commands work seamlessly in Python environment",
      "Split-panel interface for file browser and package manager",
      "Resizable panels for optimal workspace customization"
    ]
  },
  {
    "date": "2025-10-15",
    "version": "v1.9.5",
    "title": "Python Forensics - Auto Filename Replacement",
    "description": "Intelligent automatic filename replacement when uploading files to Python environment.",
    "changes": [
      "Auto-replace 'sample.bin' with actual uploaded filename in all script tabs",
      "Smart regex matching handles both single and double quotes",
      "Applies to all open tabs simultaneously when file is uploaded",
      "Works with both file and folder uploads",
      "Preserves relative paths for files in subdirectories"
    ]
  },
  {
    "date": "2025-10-15",
    "version": "v1.9.4",
    "title": "Python Forensics - Simplified File Paths",
    "description": "Streamlined file path handling by changing Pyodide working directory to /uploads/.",
    "changes": [
      "Changed Pyodide working directory to /uploads/ for simpler paths",
      "Scripts can now use simple paths like 'sample.bin' instead of '/uploads/sample.bin'",
      "Updated all 17 CTF scripts to use simplified path format",
      "Updated Quick Guide to reflect new path convention",
      "More intuitive for CTF users familiar with standard command-line workflows"
    ]
  },
  {
    "date": "2025-10-15",
    "version": "v1.9.3",
    "title": "Python Forensics - Enhanced Terminal Banner",
    "description": "Redesigned terminal idle screen with ASCII art banner and GitHub link.",
    "changes": [
      "Added custom ASCII art banner for SecToolbox branding",
      "System initialization status display showing Pyodide version and tools count",
      "GitHub repository link prominently displayed on idle screen",
      "Cute ASCII cat art for visual appeal",
      "Professional formatting with proper spacing and alignment",
      "Green/cyan color scheme for terminal aesthetic"
    ]
  },
  {
    "date": "2025-10-15",
    "version": "v1.9.2",
    "title": "Python Forensics - 17 CTF Scripts Added",
    "description": "Comprehensive collection of 17 CTF-focused forensics scripts organized by category.",
    "changes": [
      "Analysis category: file-hash.py, entropy-calculator.py, file-signature.py, hex-dump.py",
      "Extraction category: string-extractor.py, url-extractor.py, email-extractor.py, ip-extractor.py, unicode-strings.py",
      "Forensics category: metadata-extractor.py, steganography-detector.py, carved-file-extractor.py, xor-bruteforce.py",
      "Decoding category: base64-decoder.py, hex-decoder.py, rot13-caesar.py, url-decode.py, multi-decoder.py",
      "All scripts include metadata headers (TITLE, DESCRIPTION, CATEGORY, AUTHOR)",
      "Full output display with no filtering to prevent information loss",
      "Error handling for file not found scenarios",
      "Optimized for CTF challenge analysis workflows"
    ]
  },
  {
    "date": "2025-10-14",
    "version": "v1.9.1",
    "title": "Python Forensics - Category Organization",
    "description": "Reorganized Python scripts into category folders with automatic discovery and filtering.",
    "changes": [
      "Created folder structure: Analysis, Extraction, Forensics, Decoding categories",
      "Automatic script discovery using Vite glob patterns (import.meta.glob)",
      "Category filter dropdown for easy script navigation",
      "Automatic category detection from folder names",
      "Updated pythonScriptLoader.ts for recursive folder discovery",
      "Replaced Code History with Undo/Redo buttons using Monaco Editor API",
      "Removed pythonExamples.ts in favor of organized folder structure",
      "Cleaner UI with category-based organization"
    ]
  },
  {
    "date": "2025-10-12",
    "version": "v1.8.0",
    "title": "Mobile Optimization & Dashboard Enhancements",
    "description": "Improved mobile responsiveness for footer layout and added threat intelligence quick access to dashboard.",
    "changes": [
      "Fixed mobile footer layout issue where 'Discussions' link wrapped to next line",
      "Reduced icon sizes and gaps on mobile devices (sm:breakpoint responsive)",
      "Added whitespace-nowrap to footer link text for better mobile display",
      "Added Threat Intel quick access button to Dashboard",
      "Updated dashboard tools grid to include threat intelligence monitoring",
      "Improved footer accessibility with responsive sizing"
    ]
  },
  {
    "date": "2025-10-12",
    "version": "v1.7.0",
    "title": "External Crypto Tools Enhancement",
    "description": "Comprehensive external cryptography tools section with detailed descriptions and improved UX.",
    "changes": [
      "Added 5 external crypto tool links with descriptions: dCode.fr, CrypTii, CacheSleuth, Boxentriq, CyberChef",
      "Moved external tools section above 'Recent Operations' for better visibility",
      "Implemented 2-column responsive grid layout for tool cards",
      "Added hover effects with accent border and background transitions",
      "Included detailed descriptions explaining each tool's specialty",
      "Globe icons for consistent visual identity across all external links"
    ]
  },
  {
    "date": "2025-10-12",
    "version": "v1.6.0",
    "title": "Crypto Tools External References",
    "description": "Initial integration of external cryptography tool redirects for expanded capabilities.",
    "changes": [
      "Added visible redirect section for external crypto tools",
      "Integrated CrypTii (Caesar cipher) quick access link",
      "Added CyberChef link for advanced data transformation",
      "Created 'Need More Crypto Tools?' section with clear call-to-action",
      "Opens external tools in new tabs with security attributes (noopener noreferrer)"
    ]
  },
  {
    "date": "2025-10-12",
    "version": "v1.5.0",
    "title": "Repository Synchronization & Documentation",
    "description": "Synchronized with latest upstream changes and improved project documentation.",
    "changes": [
      "Fetched and merged latest changes from sectoolbox/sectoolbox main branch",
      "Added MIT LICENSE to project root",
      "Updated package.json with proper metadata and license information",
      "Synchronized with v1.0.0 release tag",
      "Updated repository documentation for clarity",
      "Fixed file permissions and line endings (LF/CRLF handling)"
    ]
  },
  {
    "date": "2025-10-11",
    "version": "v1.4.0",
    "title": "Network Scanning & Payload Customization",
    "description": "Added HackerTarget Nmap integration with multiple scan types, comprehensive payload substitution system, and enhanced binary file analysis.",
    "changes": [
      "HackerTarget Nmap API integration with API key authentication",
      "Multiple scan type support: Nmap, DNS lookup, Reverse DNS, Host search, WHOIS, Zone transfer",
      "Target configuration system for Web Tools with domain, IP, and callback URL inputs",
      "Dynamic payload substitution with toggle control for XSS, SQL, RCE, SSRF, XXE, OAuth, LFI/RFI, CSRF payloads",
      "Comprehensive placeholder support with {DOMAIN}, {URL}, {IP}, {ATTACKER_IP}, {CALLBACK_URL} templates",
      "Enhanced Folder Scanner with multi-encoding string extraction (ASCII, UTF-8, UTF-16 LE/BE)",
      "Hex dump viewer for binary file inspection (first 1KB)",
      "Raw binary preview with advanced string detection",
      "Removed EVTX handling from Image Analysis page for cleaner separation of concerns",
      "Fixed syntax errors in ImageAnalysis tab conditionals"
    ]
  },
  {
    "date": "2025-10-10",
    "version": "v1.3.0",
    "title": "Threat Intelligence Integration",
    "description": "Comprehensive threat intelligence capabilities with 8 industry-standard APIs for malware analysis, breach detection, and security research.",
    "changes": [
      "VirusTotal API integration for malware scanning of files, URLs, domains, and IPs",
      "HaveIBeenPwned integration with k-anonymity for password and breach checking",
      "URLhaus malware database for URL reputation checking",
      "PhishStats phishing database for malicious site detection",
      "Cloudflare Trace for IP and visitor information lookup",
      "AbuseIPDB for IP reputation and abuse report checking",
      "GreyNoise community API for internet scanner identification",
      "AlienVault OTX threat intelligence platform integration",
      "Unified threat intelligence page with tabbed interface for all 8 APIs",
      "Serverless API proxies for CORS-free access to all services",
      "JSON export functionality for threat intelligence results",
      "Search integration with 8 new threat intel tools in database"
    ]
  },
  {
    "date": "2025-10-10",
    "version": "v1.2.0",
    "title": "Navigation Overhaul & UI Refinements",
    "description": "Complete navigation redesign with dropdown menus, comprehensive search, and multiple UI improvements.",
    "changes": [
      "Dropdown navigation with organized Analysis and Security Tools categories",
      "Global search functionality across all 60+ tools with keyword matching",
      "Mobile-responsive hamburger menu with organized sections",
      "Footer alignment fixes and padding adjustments",
      "Button label clarification across PCAP and Forensics pages",
      "Standardized button styling for consistency"
    ]
  },
  {
    "date": "2025-10-09",
    "version": "v1.1.0",
    "title": "Network Analysis & Memory Forensics",
    "description": "Added comprehensive network intelligence tools and advanced memory dump analysis capabilities.",
    "changes": [
      "Network analysis page with Shodan, IPInfo, PassiveDNS, crt.sh integration",
      "Archive.org CDX API with pagination, filtering, and injection point detection",
      "Memory Forensics module with process, DLL, network, and handle analysis",
      "Vercel serverless functions for CORS-free API access",
      "Quick upload cards for all major analysis types on Dashboard",
      "Folder Scanner auto-analyze functionality",
      "Web Tools favorites filter fix"
    ]
  },
  {
    "date": "2025-10-08",
    "version": "v1.0.0",
    "title": "Initial Release - Sectoolbox Launch",
    "description": "Professional cybersecurity toolkit for CTF competitions and security research now available.",
    "changes": [
      "Initial public release with complete toolkit suite",
      "Modern responsive UI design with dark mode",
      "Vercel deployment ready",
      "Complete documentation and usage guides"
    ]
  },
  {
    "date": "2025-10-08",
    "version": "v1.0.0-beta",
    "title": "Digital Forensics Suite",
    "description": "Comprehensive file analysis and digital evidence examination capabilities.",
    "changes": [
      "PCAP Analysis with network packet inspection and protocol analysis",
      "USB PCAP Analysis for USB traffic forensics",
      "EVTX Analysis for Windows Event Log parsing",
      "File signature and hex dump examination",
      "Entropy and statistical analysis",
      "Export functionality for all analysis types"
    ]
  },
  {
    "date": "2025-10-08",
    "version": "v1.0.0-beta",
    "title": "Image & Audio Analysis",
    "description": "Advanced media forensics tools for image and audio file investigation.",
    "changes": [
      "EXIF metadata extraction with GPS data",
      "Steganography detection and hidden data extraction",
      "Bit plane analysis and QR code scanning",
      "Spectral analysis for audio files",
      "DTMF detection and waveform visualization",
      "LSB analysis for hidden audio data"
    ]
  },
  {
    "date": "2025-10-08",
    "version": "v1.0.0-beta",
    "title": "Web Security & Cryptography",
    "description": "Extensive web exploitation payloads and cryptographic analysis tools.",
    "changes": [
      "240+ attack payloads across 26 categories",
      "SQL Injection, XSS, RCE, LFI/RFI, SSTI payloads",
      "Encoding/decoding tools (Base64, Hex, URL, Binary)",
      "Hash analysis and identification (MD5, SHA family)",
      "Classical ciphers (Caesar, Vigenere, ROT13, Atbash)",
      "Frequency analysis for cryptanalysis"
    ]
  },
  {
    "date": "2025-10-08",
    "version": "v1.0.0-alpha",
    "title": "Core Platform Development",
    "description": "Foundation development with modern React architecture and security focus.",
    "changes": [
      "React 19 + TypeScript 5.8 foundation",
      "Tailwind CSS + Shadcn/ui components",
      "Vite 7 build system optimization",
      "React Router 7 for navigation",
      "Responsive design implementation",
      "Dark mode interface"
    ]
  },
  {
    "date": "2025-10-07",
    "version": "v0.9.0-alpha",
    "title": "Project Initialization",
    "description": "Initial project setup and architecture planning for professional cybersecurity toolkit.",
    "changes": [
      "Project structure and planning",
      "Development environment setup",
      "Build and deployment configuration",
      "Documentation and contribution guidelines"
    ]
  }
]
